Short description:
On host A, ~/.emacs.d/conf/cloud/individual.passes is saved in BJW.gpg, and
when I switch to host B and run (cloud-start), the system thinks that
~/.emacs.d/conf/cloud/individual.passes is not yet clouded and 
assigns it another (CAP) cipher-name.

here is the log:
===============

Loading /home/shalaev/Private/work/done/cloud/tests/ert.el (source)...
:debug 17:53:03.000 debug-set:old values -->
:debug 17:53:03.000 root-test-dir= nil
:debug 17:53:03.000 updated values -->
:debug 17:53:03.000 root-test-dir = /tmp/cloud.test.V75fnh/
Running 1 tests (2021-05-25 17:53:03-0400)
Loading /home/shalaev/Private/work/done/cloud/tests/cloud.el (source)...
:debug 17:53:03.000 debug-set:old values -->
:debug 17:53:03.000 ~= /home/shalaev/
:debug 17:53:03.000 localhost= kalinin
:debug 17:53:03.000 *config-directory*= /home/shalaev/.emacs.d/conf/
:debug 17:53:03.000 updated values -->
:debug 17:53:03.000 ~ = /tmp/cloud.test.V75fnh/hostA/
:debug 17:53:03.000 localhost = hostA
:debug 17:53:03.000 *config-directory* = ~/.emacs.d/conf/
:debug 17:53:03.000 1 local/host/conf= /tmp/cloud.test.V75fnh/hostA/.emacs.d/conf/cloud/hostA.conf
:debug 17:53:03.000 1 configured= yes
:debug 17:53:03.000 2 configured= yes
entering cloud-start
:debug 17:53:03.000 4 configured= yes

 entering add-file
  entering cloud-locate-FN
  leaving cloud-locate-FN
  entering cloud-get-file-properties
  leaving cloud-get-file-properties
  entering new-file-in
  leaving new-file-in
:info 17:53:03.000 file ~/.emacs.d/conf/cloud/individual.passes is now clouded
 leaving add-file
 entering reset-Makefile
 leaving reset-Makefile
 entering cloud-sync
  entering cloud-connected-p
  leaving cloud-connected-p
  entering TS
  leaving TS
:info 17:53:03.000 first run: creating /tmp/cloud.test.V75fnh/hostA/.emacs.d/conf/cloud/hostA/all and AbC
  entering reset-Makefile
  leaving reset-Makefile
  entering write-all
   entering print-hosts
    entering backspace
    leaving backspace
   leaving print-hosts
** ghost actions
On one host I =cloud-forget= a file which was not clouded on another host (kalinin)
So there was nothing to do on kalinin, but the action did not disappear, it multiplicated itself instead, so
#+BEGIN_SRC emacs-lisp :results drawer
(mapcar #'format-action remote-actions)
#+END_SRC

#+RESULTS:
:RESULTS:
("2020-11-30 17:29:32 EST" 0 1 "/etc/backup2l.conf"  "kolmogorov"  
 "2020-11-30 17:29:32 EST" 0 1 "/etc/backup2l.conf"  "kolmogorov"  
 "2020-11-30 17:29:32 EST" 0 1 "/etc/backup2l.conf"  "kolmogorov" )
:END:

